int/resources/objectRepo/xmlTemplates/ows/OWSProfileService/req_FetchClaimsStatus.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:core="http://webservices.micros.com/og/4.3/Core/" xmlns:hot="http://webservices.micros.com/og/4.3/HotelCommon/" xmlns:name="http://webservices.micros.com/ows/5.1/Name.wsdl">
   <soapenv:Header>
      <core:OGHeader authToken="?" channelValidation="true" primaryLangID="E" terminalID="?" timeStamp="?" transactionID="?">
         <core:Origin entityID="?" organizationID="?" systemType="?"/>
         <core:Destination entityID="?" organizationID="?" systemType="?"/>
         <core:Intermediaries>
            <core:EndPoint entityID="?" organizationID="?" systemType="?"/>
         </core:Intermediaries>
         <core:Authentication>
            <core:UserCredentials>
               <core:UserName/>
               <core:UserPassword/>
               <core:Domain/>
               <core:SecurityId/>
            </core:UserCredentials>
            <core:Licence>
               <core:Key/>
            </core:Licence>
         </core:Authentication>
      </core:OGHeader>
   </soapenv:Header>
   <soapenv:Body>
      <name:FetchClaimsStatusRequest>
         <name:NameID source="?" type="?"/>
         <name:BeginDate/>
         <name:EndDate/>
         <name:MembershipType/>
         <name:MembershipCardNumber/>
         <name:ClaimId/>
         <name:ClaimType/>
         <name:ClaimSource/>
         <name:ClaimOwner/>
         <name:HotelReferences>
            <hot:HotelReference chainCode="?" hotelCode="?"/>
         </name:HotelReferences>
         <name:ConfirmationNumber/>
      </name:FetchClaimsStatusRequest>
   </soapenv:Body>
</soapenv:Envelope>